lains/stm32-linky-display/src/main.cpp
class TicFrameParser {
public:
    TicFrameParser() :
        nbFramesParsed(0),
        de(ticFrameParserUnWrapDatasetExtracter, this),
        lastFrameMeasurements() { }

    void onNewMeasurementAvailable() {
        if (this->lastFrameMeasurements.fromFrameNb != this->nbFramesParsed) {
            TicMeasurements blankMeasurements(this->nbFramesParsed);
            std::swap(this->lastFrameMeasurements, blankMeasurements);  /* Create a new empty measurement datastore for the new frame */
        }
    }

    void onNewDate(const TIC::Horodate& horodate) {
        this->onNewMeasurementAvailable();
        this->lastFrameMeasurements.horodate = horodate;
    }

    void onRefPowerInfo(uint32_t power) {
        //FIXME: Todo
    }

    /**
     * @brief Take into account a refreshed instantenous power measurement
     * 
     * @param power The instantaneous power (in Watts)
     */
    void onNewInstPowerMesurement(uint32_t power) {
        this->onNewMeasurementAvailable();
        this->lastFrameMeasurements.instDrawnPower = power;
    }

    /**
     * @brief Take into account a refreshed instantenous voltage measurement
     * 
     * @param voltage The instantaneous mains voltage (in Volts)
     */
    void onNewInstVoltageMeasurement(uint32_t voltage) {
        this->onNewMeasurementAvailable();
        this->lastFrameMeasurements.instVoltage = voltage;
        this->mayComputePowerFromIURms();
    }

    /**
     * @brief Take into account a refreshed instantenous current measurement
     * 
     * @param voltage The instantaneous mains absolute current (in Amperes), the sign is not provided so this current can be widthdrawn or injected
     */
    void onNewInstCurrentMeasurement(uint32_t current) {
        this->onNewMeasurementAvailable();
        this->lastFrameMeasurements.instAbsCurrent = current;
        this->mayComputePowerFromIURms();
    }

    void mayComputePowerFromIURms() {
        if (this->lastFrameMeasurements.instVoltage != static_cast<unsigned int>(-1) &&
            this->lastFrameMeasurements.instAbsCurrent != static_cast<unsigned int>(-1)) {
            /* We have both voltage and current, we can grossly approximate the power (withdrawn or injected) */
            this->lastFrameMeasurements.instEvalPower.isValid = true;
            //FIXME: todo
        }
    }

    /* The 3 methods below are invoked as callbacks by TIC::Unframer and TIC::DatasetExtractor durig the TIC decoding process */
    /**
     * @brief Method invoked on new bytes received inside a TIC frame
     * 
     * When receiving new bytes, we will directly forward them to the encapsulated dataset extractor
     * 
     * @param buf A buffer containing new TIC frame bytes
     * @param len The number of bytes stored inside @p buf
     */
    void onNewFrameBytes(const uint8_t* buf, std::size_t cnt) {
        this->de.pushBytes(buf, cnt);   /* Forward the bytes to the dataset extractor */
    }

    /**
     * @brief Method invoked when we reach the end of a TIC frame
     * 
     * @warning When reaching the end of a frame, it is mandatory to reset the encapsulated dataset extractor state, so that it starts from scratch on the next frame.
     *          Not doing so would mix datasets content accross two successive frames if we have unterminated datasets, which may happen in historical TIC streams
     */
    void onFrameComplete() {
        this->de.reset();
        BSP_LED_Toggle(LED1); // Toggle the green LED when a frame has been received
        this->nbFramesParsed++;
    }

    static uint32_t uint32FromValueBuffer(const uint8_t* buf, std::size_t cnt) {
        uint32_t result = 0;
        for (std::size_t idx = 0; idx < cnt; idx++) {
            uint8_t digit = buf[idx];
            if (digit < '0' || digit > '9') {   /* Invalid decimal value */
                return -1;
            }
            if (result > ((uint32_t)-1 / 10)) { /* Failsafe: multiplication by 10 would overflow uint32_t */
                return -1;
            }
            result *= 10;
            if (result > (uint32_t)-1 - (digit - '0')) {    /* Failsafe: addition of unit would overflow uint32_t */
                return -1;
            }
            result += (digit - '0');    /* Take this digit into account */
        }
        return result;
    }

    /**
     * @brief Method invoken when a new dataset has been extracted from the TIC stream
     * 
     * @param buf A buffer containing full TIC dataset bytes
     * @param len The number of bytes stored inside @p buf
     */
    void onDatasetExtracted(const uint8_t* buf, std::size_t cnt) {
        /* This is our actual parsing of a newly received dataset */
        TIC::DatasetView dv(buf, cnt);    /* Decode the TIC dataset using a dataset view object */
        if (dv.isValid()) {
            if (dv.labelSz == 4 &&
                memcmp(dv.labelBuffer, "DATE", 4) == 0) {
                /* The current label is a DATE */
                if (dv.horodate.isValid) {
                    this->onNewDate(dv.horodate);
                }
            }
            /* Search for SINSTS */
            else if (dv.labelSz == 6 &&
                memcmp(dv.labelBuffer, "SINSTS", 6) == 0 &&
                dv.dataSz > 0) {
                /* The current label is a SINSTS with some value associated */
                uint32_t sinsts = uint32FromValueBuffer(dv.dataBuffer, dv.dataSz);
                if (sinsts != (uint32_t)-1)
                    this->onNewInstPowerMesurement(sinsts);
            }
            /* Search for URMS1 */
            else if (dv.labelSz == 5 &&
                memcmp(dv.labelBuffer, "URMS1", 5) == 0 &&
                dv.dataSz > 0) {
                /* The current label is a URMS1 with some value associated */
                uint32_t urms1 = uint32FromValueBuffer(dv.dataBuffer, dv.dataSz);
                if (urms1 != (uint32_t)-1)
                    this->onNewInstVoltageMeasurement(urms1);
            }
            /* Search for IRMS1 */
            else if (dv.labelSz == 5 &&
                memcmp(dv.labelBuffer, "IRMS1", 5) == 0 &&
                dv.dataSz > 0) {
                /* The current label is a URMS1 with some value associated */
                uint32_t irms1 = uint32FromValueBuffer(dv.dataBuffer, dv.dataSz);
                if (irms1 != (uint32_t)-1)
                    this->onNewInstCurrentMeasurement(irms1);
            }
            /* Search for PREF */
            else if (dv.labelSz == 4 &&
                memcmp(dv.labelBuffer, "PREF", 4) == 0 &&
                dv.dataSz > 0) {
                /* The current label is a URMS1 with some value associated */
                uint32_t pref = uint32FromValueBuffer(dv.dataBuffer, dv.dataSz);
                if (pref != (uint32_t)-1)
                    this->onRefPowerInfo(pref);
            }
        }
    }

    /* The 3 commodity functions below are used as callbacks to retrieve a TicFrameParser casted as a context */
    /* They are retrieving our instance on TicFrameParser, and invoking the 3 above corresponding methods of TicFrameParser, forwarding their arguments */
    /**
     * @brief Utility function to unwrap a TicFrameParser instance and invoke onNewFrameBytes() on it
     * It is used as a callback provided to TIC::Unframer
     * 
     * @param buf A buffer containing new TIC frame bytes
     * @param len The number of bytes stored inside @p buf
     * @param context A context as provided by TIC::Unframer, used to retrieve the wrapped TicFrameParser instance
     */
    static void unwrapInvokeOnFrameNewBytes(const uint8_t* buf, std::size_t cnt, void* context) {
        if (context == NULL)
            return; /* Failsafe, discard if no context */
        TicFrameParser* ticFrameParserInstance = static_cast<TicFrameParser*>(context);
        ticFrameParserInstance->onNewFrameBytes(buf, cnt);
    }

    /**
     * @brief Utility function to unwrap a TicFrameParser instance and invoke onFrameComplete() on it
     * It is used as a callback provided to TIC::Unframer
     * 
     * @param context A context as provided by TIC::Unframer, used to retrieve the wrapped TicFrameParser instance
     */
    static void unwrapInvokeOnFrameComplete(void *context) {
        if (context == NULL)
            return; /* Failsafe, discard if no context */
        TicFrameParser* ticFrameParserInstance = static_cast<TicFrameParser*>(context);
        /* We have finished parsing a frame, if there is an open dataset, we should discard it and start over at the following frame */
        ticFrameParserInstance->onFrameComplete();
    }

    /**
     * @brief Utility function to unwrap a TicFrameParser instance and invoke onDatasetExtracted() on it
     * It is used as a callback provided to TIC::DatasetExtractor
     * 
     * @param context A context as provided by TIC::DatasetExtractor, used to retrieve the wrapped TicFrameParser instance
     */
    static void ticFrameParserUnWrapDatasetExtracter(const uint8_t* buf, std::size_t cnt, void* context) {
        if (context == NULL)
            return; /* Failsafe, discard if no context */
        TicFrameParser* ticFrameParserInstance = static_cast<TicFrameParser*>(context);
        /* We have finished parsing a frame, if there is an open dataset, we should discard it and start over at the following frame */
        ticFrameParserInstance->onDatasetExtracted(buf, cnt);
    }

/* Attributes */
    unsigned int nbFramesParsed; /*!< Total number of complete frames parsed */
    TIC::DatasetExtractor de;   /*!< The encapsulated dataset extractor instance (programmed to call us back on newly decoded datasets) */
    TicMeasurements lastFrameMeasurements;    /*!< Gathers all interesting measurement of the last frame */
};

/**
 * @brief  Main program
 */
int main(void) {
    /* STM32F4xx HAL library initialization:
      - Configure the Flash prefetch, instruction and Data caches
      - Systick timer is configured by default as source of time base, but user 
        can eventually implement his proper time base source (a general purpose 
        timer for example or other time source), keeping in mind that Time base 
        duration should be kept 1ms since PPP_TIMEOUT_VALUEs are defined and 
        handled in milliseconds basis.
      - Set NVIC Group Priority to 4
      - Low Level Initialization: global MSP (MCU Support Package) initialization
    */
    HAL_Init();
  
    /* Configure the system clock to 180 MHz */
    SystemClock_Config();

    /* Configure LED1, LED2, LED3 and LED4 */
    BSP_LED_Init(LED1);
    BSP_LED_Init(LED2);
    BSP_LED_Init(LED3);
    BSP_LED_Init(LED4);
    BSP_LED_On(LED2);
    waitDelay(250);
    BSP_LED_Off(LED2);

